Tekla.Structures.Drawing.IEvents
Interface for the Events class allows the user to register event listeners for Drawings events.
This interface allows the Marshaling of the Events class with Trimble.Remoting

Tekla.Structures.Drawing.IEvents.DrawingInserted
The DrawingInserted event is raised when a drawing has been inserted.

Tekla.Structures.Drawing.IEvents.DrawingDeleted
The DrawingDeleted event is raised when a drawing has been deleted.

Tekla.Structures.Drawing.IEvents.DrawingStatusChanged
The DrawingStatusChanged event is raised when the drawing status has changed.

Tekla.Structures.Drawing.IEvents.DrawingChanged
The DrawingChanged event is raised when the drawing has been changed and the database is committed.

Tekla.Structures.Drawing.IEvents.DrawingUpdated
The DrawingUpdated event is raised when the drawing has been inserted, deleted or modified, and the database is committed.

Tekla.Structures.Drawing.IEvents.DrawingReadyForIssuingChange
The DrawingReadyForIssuingChange event is raised just after a drawing is marked or unmarked ready for issuing.

Tekla.Structures.Drawing.IEvents.HasDrawingUpdatedListeners


Tekla.Structures.Drawing.IEvents.OnDrawingInserted(System.String,System.Object[])


Tekla.Structures.Drawing.IEvents.OnDrawingDeleted(System.String,System.Object[])


Tekla.Structures.Drawing.IEvents.OnDrawingStatusChanged(System.String,System.Object[])


Tekla.Structures.Drawing.IEvents.OnDrawingChanged(System.String,System.Object[])


Tekla.Structures.Drawing.IEvents.OnDrawingUpdated(System.String,System.Object[])


Tekla.Structures.Drawing.IEvents.OnDrawingReadyForIssuingChange(System.String,System.Boolean)


Tekla.Structures.Drawing.IEvents.Register
Registers the instance to listen to the specified events.
Throws System.InvalidOperationException: Thrown if attempting registration when already registered.

Tekla.Structures.Drawing.IEvents.UnRegister
Unregisters the instance from listening to events.